# <center> hw2

In [6]:
import pandas as pd
df=pd.read_csv('homes.csv')

In [7]:
df.head()

,price,area,beds,baths,garage,year,style,lotsize,ac,pool,quality,highway
0,920000,3857,4,5,3,1997,1,32793,YES,NO,HIGH,NO
1,855000,4756,4,4,3,1990,7,22215,YES,NO,HIGH,NO
2,830000,3889,4,4,3,1991,7,28378,YES,NO,HIGH,NO
3,790000,4418,5,5,3,1997,7,22024,YES,NO,HIGH,NO
4,780000,4419,4,5,7,1987,1,56127,YES,NO,HIGH,NO

# 1

In [8]:
pd.value_counts(df['style'])

1     214
7     136
3      64
2      58
6      18
5      18
4      11
11      1
10      1
9       1
Name: style, dtype: int64

# 2

In [9]:
df2=df.loc[:,df.dtypes!=object]
df2.describe().iloc[[3,5,7],:]

        price    area  beds  baths  garage    year  style  lotsize
min   84000.0   980.0   0.0    0.0     0.0  1885.0    1.0   4560.0
50%  229900.0  2061.0   3.0    3.0     2.0  1966.0    2.0  22200.0
max  920000.0  5032.0   7.0    7.0     7.0  1998.0   11.0  86830.0

# 3

In [10]:
df3=df[df.beds>=3]
df3[df3.price==df3.price.max()]

,price,area,beds,baths,garage,year,style,lotsize,ac,pool,quality,highway
0,920000,3857,4,5,3,1997,1,32793,YES,NO,HIGH,NO

# 4

In [11]:
df[(df.beds>=2)&(df.beds<=4)&(df.area>4000)&(df.price>=350000)]

,price,area,beds,baths,garage,year,style,lotsize,ac,pool,quality,highway
1,855000,4756,4,4,3,1990,7,22215,YES,NO,HIGH,NO
4,780000,4419,4,5,7,1987,1,56127,YES,NO,HIGH,NO
9,665000,4746,4,4,3,1996,7,23368,YES,NO,HIGH,NO
103,395000,4150,4,3,3,1934,7,21778,NO,NO,MEDIUM,NO

# 5

In [12]:
df[df.year>1970].lotsize.mean()

24145.651785714286

# 6

In [13]:
df[df.pool=='YES'].price.mean()-df[df.pool=='NO'].price.mean()

79724.36213991768

# 7

In [14]:
df.groupby('quality')['price'].agg([np.max,np.min])

           amax    amin
quality
HIGH     920000  325000
LOW      359900   84000
MEDIUM   675000  140400

# 8

In [15]:
pd.crosstab(index=df['style'],columns=df['beds'])

beds   0  1   2   3   4   5  6  7
style
1      1  8  46  92  55  11  1  0
2      0  0   0  31  24   2  1  0
3      0  0   6  34  18   6  0  0
4      0  0   3   5   2   1  0  0
5      0  0   3   4   6   5  0  0
6      0  0   0   7   7   4  0  0
7      0  0   6  28  67  23  9  3
9      0  0   0   1   0   0  0  0
10     0  0   0   0   0   0  1  0
11     0  1   0   0   0   0  0  0

# 9

In [25]:
df.rename(columns={'style':'style_'},inplace=True)
df9=df[df.style_==1]
df9=df9[df9.price==df9.price.min()]
df9

,price,area,beds,baths,garage,year,style_,lotsize,ac,pool,quality,highway
53,84000,980,1,1,1,1951,1,17686,NO,NO,LOW,NO

# 10

In [26]:
df10=df.loc[:,df.dtypes==object]
for col in df10.columns:
    dfi=df.groupby(col)[col].agg('count')
    print(dfi)
    print('\n')

ac
NO      88
YES    434
Name: ac, dtype: int64


pool
NO     486
YES     36
Name: pool, dtype: int64


quality
HIGH       68
LOW       164
MEDIUM    290
Name: quality, dtype: int64


highway
NO     511
YES     11
Name: highway, dtype: int64